Public Member Functions | Public Attributes | List of all members
APIOptional< T > Struct Template Reference
API Infrastructure
Represents an optional in the API layer. More...
#include <API_ValueWrappers.hpp>
 Public Member Functions
 template<typename K >
void  | operator= (K v)
 void  | operator= (NullValueType nullOpt)
 Public Attributes
 bool  | hasValue
 T  | value
Detailed Description
template<typename T>
 struct APIOptional< T >
Represents an optional in the API layer.
Since
Archicad 27